
#task 1

print("-------------TASK-1-------------")

mytuple = ('1', '2', '3', '4', '5')

print(mytuple[0], mytuple[1])

#task 2

print("-------------TASK-2-------------")

numbers = (2, 56, 99, 22, 15, 23, 66, 11, 134, 23, 66, 91, 22, 2, 23)

print(numbers.count(23))

#task 3

print("-------------TASK-3-------------")

aura = (10, 25, 5, 80, 70, 20)

print(*[i for i in aura if i > 10])

#task 4

'''
განსხვავებები სიებსა და კორტეჟებს შორის:

    1.mutability - სიების ელემენტების შეცვლა მეთოდების ან ინდექსების საშუალებით შეგვიძლია, ხოლო კორტეჟები ამ მხრივ მთლიანად უცვლელები არიან.

    2.სია იწერება [] საშუალებით, კორტეჟი - ()

    3.მეთოდები - კორტეჟებთან არ შეგვიძლია გამოვიყენოთ კოლექციის ისეთი მეთოდები, რომლებიც მას ასე, თუ ისე ცვლიან - მაგ(append, pop და ა.შ.).

    4.გამოყენება - კორტეჟს იყენებენ მაშინ, როდესაც დარწმუნებით იციან, რომ მის შემადგენელი ელემენტები არ შეიცვლება.

    5.ადგილი მეხსიერებაში - კორტეჟები უფრო ნაკლებ ადგილს იკავებენ, ვიდრე სიები.

    6.კორტეჟი შეგვიძლია გამოვიყენოთ, როგორც ლექსიკონის(dictionary) გასაღები.

'''

#task 5 

'''
    mutable არის ისეთი მნიშვნელობა(value), რომელიც მისი შექმნიდან კოდის მსვლელობის განმავლობაში, გარკვეული მეთოდების, თუ ფუნქციების საშუალებით შეიძლება შეიცვალოს.

    immutable შესაბამისად არის mutable_ს საწინააღმდეგო.
'''